Revit 2027 API
BuiltInFailures.CurtainGridFamilyFailures.CannotPlaceSystemPanelsInOldArcedCurtainWalls Property
 Can't place System Panels in arced Curtain Walls created prior to 3.0, nor in straight Curtain Walls created prior to version 2.0.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotPlaceSystemPanelsInOldArcedCurtainWalls { get; }
Public Shared ReadOnly Property CannotPlaceSystemPanelsInOldArcedCurtainWalls As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotPlaceSystemPanelsInOldArcedCurtainWalls {
	FailureDefinitionId^ get ();
}
static member CannotPlaceSystemPanelsInOldArcedCurtainWalls : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CurtainGridFamilyFailures Class
Autodesk.Revit.DB Namespace